qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F3/stm32f3xx_hal_spi.h
}HAL_SPI_StateTypeDef;

/** 
  * @brief  HAL SPI Error Code structure definition  
  */ 
typedef enum
{
  HAL_SPI_ERROR_NONE      = 0x00,  /*!< No error                          */
  HAL_SPI_ERROR_MODF      = 0x01,  /*!< MODF error                        */
  HAL_SPI_ERROR_CRC       = 0x02,  /*!< CRC error                         */
  HAL_SPI_ERROR_OVR       = 0x04,  /*!< OVR error                         */
  HAL_SPI_ERROR_FRE       = 0x08,  /*!< FRE error                         */
  HAL_SPI_ERROR_DMA       = 0x10,  /*!< DMA transfer error                */
  HAL_SPI_ERROR_FLAG      = 0x20,  /*!< Error on BSY/TXE/FTLVL/FRLVL Flag */  
  HAL_SPI_ERROR_UNKNOW    = 0x40,  /*!< Unknow Error error                */   
}HAL_SPI_ErrorTypeDef;

/** 
  * @brief  SPI handle Structure definition  
  */ 
typedef struct __SPI_HandleTypeDef
{
  SPI_TypeDef             *Instance;           /* SPI registers base address     */
  
  SPI_InitTypeDef              Init;           /* SPI communication parameters   */
  
  uint8_t               *pTxBuffPtr;           /* Pointer to SPI Tx transfer Buffer */
  
  uint16_t               TxXferSize;           /* SPI Tx Transfer size */
  
  uint16_t               TxXferCount;          /* SPI Tx Transfer Counter */

  uint8_t               *pRxBuffPtr;           /* Pointer to SPI Rx transfer Buffer */
  
  uint16_t                RxXferSize;          /* SPI Rx Transfer size */
  
  uint16_t               RxXferCount;          /* SPI Rx Transfer Counter */
  
  uint32_t                   CRCSize;          /* SPI CRC size used for the transfer */

  void (*RxISR)(struct __SPI_HandleTypeDef *hspi); /* function pointer on Rx IRQ handler   */
  
  void (*TxISR)(struct __SPI_HandleTypeDef *hspi); /* function pointer on Tx IRQ handler   */

  DMA_HandleTypeDef          *hdmatx;          /* SPI Tx DMA Handle parameters   */

  DMA_HandleTypeDef          *hdmarx;          /* SPI Rx DMA Handle parameters   */
  
  HAL_LockTypeDef               Lock;          /* Locking object                 */

  HAL_SPI_StateTypeDef         State;          /* SPI communication state        */
  
  HAL_SPI_ErrorTypeDef     ErrorCode;         /* SPI Error code                 */

}SPI_HandleTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup SPI_Exported_Constants SPI Exported Constants
  * @{
  */

/** @defgroup SPI_mode SPI mode
  * @{
  */  

#define SPI_MODE_SLAVE                  ((uint32_t)0x00000000)
#define SPI_MODE_MASTER                 (SPI_CR1_MSTR | SPI_CR1_SSI)
#define IS_SPI_MODE(MODE) (((MODE) == SPI_MODE_SLAVE) || \
                           ((MODE) == SPI_MODE_MASTER))
/**
  * @}
  */

/** @defgroup SPI_Direction  SPI Direction
  * @{
  */
#define SPI_DIRECTION_2LINES             ((uint32_t)0x00000000)
#define SPI_DIRECTION_2LINES_RXONLY      SPI_CR1_RXONLY
#define SPI_DIRECTION_1LINE              SPI_CR1_BIDIMODE
   
#define IS_SPI_DIRECTION(MODE)   (((MODE) == SPI_DIRECTION_2LINES) || \
                                  ((MODE) == SPI_DIRECTION_2LINES_RXONLY) ||\
                                  ((MODE) == SPI_DIRECTION_1LINE))

#define IS_SPI_DIRECTION_2LINES(MODE) ((MODE) == SPI_DIRECTION_2LINES)    

#define IS_SPI_DIRECTION_2LINES_OR_1LINE(MODE) (((MODE) == SPI_DIRECTION_2LINES)|| \
                                                 ((MODE) == SPI_DIRECTION_1LINE))
/**
  * @}
  */
  
/** @defgroup SPI_data_size SPI data size
  * @{
  */

#define SPI_DATASIZE_4BIT                 ((uint16_t)0x0300)
#define SPI_DATASIZE_5BIT                 ((uint16_t)0x0400)
#define SPI_DATASIZE_6BIT                 ((uint16_t)0x0500)
#define SPI_DATASIZE_7BIT                 ((uint16_t)0x0600)
#define SPI_DATASIZE_8BIT                 ((uint16_t)0x0700)
#define SPI_DATASIZE_9BIT                 ((uint16_t)0x0800)
#define SPI_DATASIZE_10BIT                ((uint16_t)0x0900)
#define SPI_DATASIZE_11BIT                ((uint16_t)0x0A00)
#define SPI_DATASIZE_12BIT                ((uint16_t)0x0B00)
#define SPI_DATASIZE_13BIT                ((uint16_t)0x0C00)
#define SPI_DATASIZE_14BIT                ((uint16_t)0x0D00)
#define SPI_DATASIZE_15BIT                ((uint16_t)0x0E00)
#define SPI_DATASIZE_16BIT                ((uint16_t)0x0F00)
#define IS_SPI_DATASIZE(DATASIZE) (((DATASIZE) == SPI_DATASIZE_16BIT) || \
                                   ((DATASIZE) == SPI_DATASIZE_15BIT) || \
                                   ((DATASIZE) == SPI_DATASIZE_14BIT) || \
                                   ((DATASIZE) == SPI_DATASIZE_13BIT) || \
                                   ((DATASIZE) == SPI_DATASIZE_12BIT) || \
                                   ((DATASIZE) == SPI_DATASIZE_11BIT) || \
                                   ((DATASIZE) == SPI_DATASIZE_10BIT) || \
                                   ((DATASIZE) == SPI_DATASIZE_9BIT)  || \
                                   ((DATASIZE) == SPI_DATASIZE_8BIT)  || \
                                   ((DATASIZE) == SPI_DATASIZE_7BIT)  || \
                                   ((DATASIZE) == SPI_DATASIZE_6BIT)  || \
                                   ((DATASIZE) == SPI_DATASIZE_5BIT)  || \
                                   ((DATASIZE) == SPI_DATASIZE_4BIT))

/**
  * @}
  */ 

/** @defgroup SPI_Clock_Polarity SPI Clock Polarity
  * @{
  */ 

#define SPI_POLARITY_LOW                ((uint32_t)0x00000000)
#define SPI_POLARITY_HIGH               SPI_CR1_CPOL
#define IS_SPI_CPOL(CPOL) (((CPOL) == SPI_POLARITY_LOW) || \
                           ((CPOL) == SPI_POLARITY_HIGH))
/**
  * @}
  */

/** @defgroup SPI_Clock_Phase  SPI Clock Phase
  * @{
  */

#define SPI_PHASE_1EDGE                 ((uint32_t)0x00000000)
#define SPI_PHASE_2EDGE                 SPI_CR1_CPHA
#define IS_SPI_CPHA(CPHA) (((CPHA) == SPI_PHASE_1EDGE) || \
                           ((CPHA) == SPI_PHASE_2EDGE))
/**
  * @}
  */

/** @defgroup SPI_Slave_Select_management SPI Slave Select management
  * @{
  */ 

#define SPI_NSS_SOFT                    SPI_CR1_SSM
#define SPI_NSS_HARD_INPUT              ((uint32_t)0x00000000)
#define SPI_NSS_HARD_OUTPUT             ((uint32_t)0x00040000)
#define IS_SPI_NSS(NSS) (((NSS) == SPI_NSS_SOFT) || \
                         ((NSS) == SPI_NSS_HARD_INPUT) || \
                         ((NSS) == SPI_NSS_HARD_OUTPUT))

   /**
  * @}
  */

 
/** @defgroup SPI_NSS SPI NSS pulse management 
  * @{
  */ 
#define SPI_NSS_PULSE_ENABLED           SPI_CR2_NSSP
#define SPI_NSS_PULSE_DISABLED          ((uint32_t)0x00000000)
   
#define IS_SPI_NSSP(NSSP) (((NSSP) == SPI_NSS_PULSE_ENABLED) || \
                           ((NSSP) == SPI_NSS_PULSE_DISABLED))                  

/**
  * @}
  */

   
