qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F3/stm32f3xx_hal_spi.h
/** @defgroup SPI_BaudRate_Prescaler SPI BaudRate Prescaler
  * @{
  */

#define SPI_BAUDRATEPRESCALER_2         ((uint32_t)0x00000000)
#define SPI_BAUDRATEPRESCALER_4         ((uint32_t)0x00000008)
#define SPI_BAUDRATEPRESCALER_8         ((uint32_t)0x00000010)
#define SPI_BAUDRATEPRESCALER_16        ((uint32_t)0x00000018)
#define SPI_BAUDRATEPRESCALER_32        ((uint32_t)0x00000020)
#define SPI_BAUDRATEPRESCALER_64        ((uint32_t)0x00000028)
#define SPI_BAUDRATEPRESCALER_128       ((uint32_t)0x00000030)
#define SPI_BAUDRATEPRESCALER_256       ((uint32_t)0x00000038)
#define IS_SPI_BAUDRATE_PRESCALER(PRESCALER) (((PRESCALER) == SPI_BAUDRATEPRESCALER_2) || \
                                              ((PRESCALER) == SPI_BAUDRATEPRESCALER_4) || \
                                              ((PRESCALER) == SPI_BAUDRATEPRESCALER_8) || \
                                              ((PRESCALER) == SPI_BAUDRATEPRESCALER_16) || \
                                              ((PRESCALER) == SPI_BAUDRATEPRESCALER_32) || \
                                              ((PRESCALER) == SPI_BAUDRATEPRESCALER_64) || \
                                              ((PRESCALER) == SPI_BAUDRATEPRESCALER_128) || \
                                              ((PRESCALER) == SPI_BAUDRATEPRESCALER_256))
/**
  * @}
  */ 

/** @defgroup SPI_MSB_LSB_transmission SPI MSB LSB transmission
  * @{
  */ 

#define SPI_FIRSTBIT_MSB                ((uint32_t)0x00000000)
#define SPI_FIRSTBIT_LSB                SPI_CR1_LSBFIRST
#define IS_SPI_FIRST_BIT(BIT) (((BIT) == SPI_FIRSTBIT_MSB) || \
                               ((BIT) == SPI_FIRSTBIT_LSB))
/**
  * @}
  */

/** @defgroup SPI_TI_mode SPI TI mode
  * @{
  */

#define SPI_TIMODE_DISABLED             ((uint32_t)0x00000000)
#define SPI_TIMODE_ENABLED              SPI_CR2_FRF
#define IS_SPI_TIMODE(MODE) (((MODE) == SPI_TIMODE_DISABLED) || \
                             ((MODE) == SPI_TIMODE_ENABLED))
/**
  * @}
  */ 
  
/** @defgroup SPI_CRC_Calculation SPI CRC Calculation
  * @{
  */

#define SPI_CRCCALCULATION_DISABLED     ((uint32_t)0x00000000)
#define SPI_CRCCALCULATION_ENABLED      SPI_CR1_CRCEN
#define IS_SPI_CRC_CALCULATION(CALCULATION) (((CALCULATION) == SPI_CRCCALCULATION_DISABLED) || \
                                             ((CALCULATION) == SPI_CRCCALCULATION_ENABLED))
/**
  * @}
  */

/** @defgroup SPI_CRC_length SPI CRC length
  * @{
  * This parameter can be one of the following values:
  *     SPI_CRC_LENGTH_DATASIZE: aligned with the data size 
  *     SPI_CRC_LENGTH_8BIT    : CRC 8bit
  *     SPI_CRC_LENGTH_16BIT   : CRC 16bit  
  */
#define SPI_CRC_LENGTH_DATASIZE 0
#define SPI_CRC_LENGTH_8BIT     1
#define SPI_CRC_LENGTH_16BIT    2   
#define IS_SPI_CRC_LENGTH(LENGTH) (((LENGTH) == SPI_CRC_LENGTH_DATASIZE) ||\
                                   ((LENGTH) == SPI_CRC_LENGTH_8BIT)  ||   \
                                   ((LENGTH) == SPI_CRC_LENGTH_16BIT))
/**
  * @}
  */
  
/** @defgroup SPI_FIFO_reception_threshold SPI FIFO reception threshold
  * @{
  * This parameter can be one of the following values:
  *     SPI_RxFIFOThreshold_HF: RXNE event is generated if the FIFO 
  *          level is greater or equal to 1/2(16-bits). 
  *     SPI_RxFIFOThreshold_QF: RXNE event is generated if the FIFO 
  *          level is greater or equal to 1/4(8 bits). 
  */
#define SPI_RXFIFO_THRESHOLD      SPI_CR2_FRXTH
#define SPI_RXFIFO_THRESHOLD_QF   SPI_CR2_FRXTH
#define SPI_RXFIFO_THRESHOLD_HF   ((uint32_t)0x0)

/**
  * @}
  */

/** @defgroup SPI_Interrupt_configuration_definition SPI Interrupt configuration definition
  * @brief SPI Interrupt definition
  *        Elements values convention: 0xXXXXXXXX
  *           - XXXXXXXX  : Interrupt control mask
 * @{
 */
#define SPI_IT_TXE                      SPI_CR2_TXEIE
#define SPI_IT_RXNE                     SPI_CR2_RXNEIE
#define SPI_IT_ERR                      SPI_CR2_ERRIE
#define IS_SPI_IT(IT) (((IT) == SPI_IT_TXE) 	|| \
                       ((IT) == SPI_IT_RXNE)	|| \
                       ((IT) == SPI_IT_ERR))
/**
  * @}
  */


/** @defgroup SPI_Flag_definition SPI Flag definition
  * @brief Flag definition
  *        Elements values convention: 0xXXXXYYYY
  *           - XXXX  : Flag register Index
  *           - YYYY  : Flag mask
  * @{
  */ 
#define SPI_FLAG_RXNE                   SPI_SR_RXNE		/* SPI status flag: Rx buffer not empty flag */
#define SPI_FLAG_TXE                    SPI_SR_TXE		/* SPI status flag: Tx buffer empty flag */
#define SPI_FLAG_BSY                    SPI_SR_BSY		/* SPI status flag: Busy flag */
#define SPI_FLAG_CRCERR                 SPI_SR_CRCERR	        /* SPI Error flag: CRC error flag */
#define SPI_FLAG_MODF                   SPI_SR_MODF		/* SPI Error flag: Mode fault flag */
#define SPI_FLAG_OVR                    SPI_SR_OVR		/* SPI Error flag: Overrun flag */
#define SPI_FLAG_FRE                    SPI_SR_FRE		/* SPI Error flag: TI mode frame format error flag */
#define SPI_FLAG_FTLVL                  SPI_SR_FTLVL            /* SPI fifo transmission level */
#define SPI_FLAG_FRLVL                  SPI_SR_FRLVL            /* SPI fifo reception level */
#define IS_SPI_FLAG(FLAG) (((FLAG) == SPI_FLAG_RXNE)  || \
                           ((FLAG) == SPI_FLAG_TXE)   || \
                       	   ((FLAG) == SPI_FLAG_BSY)   || \
                      	   ((FLAG) == SPI_FLAG_CRCERR)|| \
                      	   ((FLAG) == SPI_FLAG_MODF)  || \
                      	   ((FLAG) == SPI_FLAG_OVR)   || \
                      	   ((FLAG) == SPI_FLAG_FTLVL) || \
                      	   ((FLAG) == SPI_FLAG_FRLVL) || \
                      	   ((FLAG) == SPI_IT_FRE))
/**
  * @}
  */


/** @defgroup SPI_transmission_fifo_status_level SPI transmission fifo status level
  * @{
  */ 

#define SPI_FTLVL_EMPTY           ((uint16_t)0x0000)
#define SPI_FTLVL_QUARTER_FULL    ((uint16_t)0x0800) 
#define SPI_FTLVL_HALF_FULL       ((uint16_t)0x1000) 
#define SPI_FTLVL_FULL            ((uint16_t)0x1800)

  
/**
  * @}
  */ 

/** @defgroup SPI_reception_fifo_status_level SPI reception fifo status level
  * @{
  */ 
#define SPI_FRLVL_EMPTY           ((uint16_t)0x0000)
#define SPI_FRLVL_QUARTER_FULL    ((uint16_t)0x0200) 
#define SPI_FRLVL_HALF_FULL       ((uint16_t)0x0400) 
#define SPI_FRLVL_FULL            ((uint16_t)0x0600)   
   
/**
  * @}
  */

/**
  * @}
  */


/* Exported macros ------------------------------------------------------------*/
/** @defgroup SPI_Exported_Macros SPI Exported Macros
 * @{
 */

/** @brief  Reset SPI handle state
  * @param  __HANDLE__: SPI handle.
  * @retval None
  */
#define __HAL_SPI_RESET_HANDLE_STATE(__HANDLE__) ((__HANDLE__)->State = HAL_SPI_STATE_RESET)

/** @brief  Enables or disables the specified SPI interrupts.
  * @param  __HANDLE__: specifies the SPI Handle.
  *         This parameter can be SPI where x: 1, 2, or 3 to select the SPI peripheral.
  * @param  __INTERRUPT__: specifies the interrupt source to enable or disable.
  *        This parameter can be one of the following values:
  *            @arg SPI_IT_TXE: Tx buffer empty interrupt enable
  *            @arg SPI_IT_RXNE: RX buffer not empty interrupt enable
  *            @arg SPI_IT_ERR: Error interrupt enable
  * @retval None
  */
  
